{
   "packageName": "Lights on Motion Plus",
   "minimumHEVersion": "2.3.4",
   "author": "Robert Morris",
   "dateReleased": "2024-02-05",
   "licenseFile": "",
   "communityLink": "https://community.hubitat.com/t/release-lights-on-motion-plus-dim-before-off-remember-individual-bulb-states-etc/7178",
   "releaseNotes": "LoMP 5.5.1: Remove extraneous 'trace' logging\n\nLoMP 5.5.3: Fix for lights erroneously turning back on if grace period configured when were not on before; CT fixes; killswitch fixes.\n\nLoMP 5.5: Add ability to use on or off for individual \"don't turn on/off/dim\" (kill) switches; remove legacy CT commands and legacy prestage preference explicit \"on\" option.; 5.5.1 - Always show option to save light states to non-exception cache (or not) for exception modes, regardless of chosen settings; bugfix for kill switches\n\nLoMP 5.4.2: Fix for error with grace period; add way to view saved light states.\n\nLoMP 5.4.1: Add Rule 5.x rules for \"run rule\" options; bugfix for grace period not being un-set in some unexpected cases.\n\nLoMP 5.4: Added option to use new (three-parameter) \"Set Color Temperature\" command (disabled by default, as not yet supported by all devices; default behavior should be identical to v5.3)\n\nLoMP 5.3: Added option to run Rule Machine rule actions when LoMP turns off or dims lights; fixed incorrect inactivity (off/dim) delay time calculation.\n\nLoMP 5.2.4: All sensors (\"turn on\" and \"keep on\") now trigger \"on\" action during grace period.\nLoMP 5.2.3: Fixed issue where UI may error if kill switches not set\nLoMP 5.2.2: Fixed \"Turn on and set level\" not honoring \"send on() after setLevel()\" preference (for prestaging)\n\nLoMP 5.2.1: Added option to use on or off state for kill switches (instead of just on).\n\nLoMP 5.2: Per-mode dim/off delay options added; new \"grace period\" option (can turn lights back on if recently turned off, regardless of \"on\" settings); bugfix for lights not turning on in some cases without \"Capture\" option enabled.\n\nLoMP 5.1: Light states restored even if non-dimming \"inactive\" action configured (in case other modes are different); fixed bug with scenes not being activated if \"off only\" inactive action configured\n\nLoMP 5.0.5 and 5.0.4: Various additional ifixes for lights not turning on in some situations\n\nLoMP 5.0.3: Fix for occasional issue where lights get stuck in 'dimmed' state and LoMP tries to restore\n\nLoMP 5.0.2: Minor bugfix for 'don't perform 'on' action if already on' setting being ignored in most cases.\n\nLoMP 5.0.1: Minor bugfix for per-mode dim-to level exceptions.\n\nLoMP 5.0 is a complete rewrite. See Community forum thread for more details.",
   "apps": [
      {
         "id": "3cff72f1-feea-48d5-91fb-b4bfda6c5f01",
         "name": "Lights on Motion Plus",
         "namespace": "RMoRobert",
         "location": "https://raw.githubusercontent.com/RMoRobert/Hubitat/master/apps/LightsOnMotionPlus/LightsOnMotionPlusParent.groovy",
         "required": true,
         "version": "5.4.1",
         "primary": true,
         "oauth": false
      },
      {
         "id": "1b601135-5aa0-4dd7-9a6c-a9533dd44e9e",
         "name": "Lights on Motion Plus (Child App) 5",
         "namespace": "RMoRobert",
         "location": "https://raw.githubusercontent.com/RMoRobert/Hubitat/master/apps/LightsOnMotionPlus/LightsOnMotionPlus5.groovy",
         "required": true,
         "version": "5.5.4",
         "oauth": false
      }
   ]
}